
lst[i] = addr memory + i * size of type
lst[0] = addr memory + 0 * 4 (NAPRIKLAD)
#Масив - неперервна ділянка памяті компютера
#Неперервна - не моєна змінювати і напрклд 28 байтів - завжди будуть 28 байтів
# якщо не вистачаэ памяті то створюється нова більша ділянка і туди переносяться стара а стара дылянка памяты видаляэться
#масив - швидкість доступу до елементів

#Якщо часто вставляти або видаляти то краще пыдходить ынша структура даних
#Список - Linked List
Node - вузол
Масив - ділянка памяті і адреса
Linked List - кожен елемент має свою ділянку памяті та адресу

Структура даних - контейнери для зберігання даних
Часто вставка і видалення - лінкед ліст
Часто читати - Масив